gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/main.c
extern bool esc_notify_flag;
extern bool start_dw_flag;
extern bool drhc_notify_flag;
extern bool cdrc_notify_flag;
extern bool rdrc_notify_flag;
static dm_application_instance_t         m_app_handle;                              /**< Application identifier allocated by device manager */

//static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HEART_RATE_SERVICE,         BLE_UUID_TYPE_BLE},
//                                   {BLE_UUID_BATTERY_SERVICE,            BLE_UUID_TYPE_BLE},
//                                   {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}}; /**< Universally unique service identifiers. */
static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}};

static int pktCounter = 0;  // need change to variable

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
//static void ble_drhc_update(void)
//{
//    uint32_t err_code;
//    uint8_t  drhc_sim_data;

//    drhc_sim_data = (uint8_t)sensorsim_measure(&m_drhc_sim_state, &m_drhc_sim_cfg);

//    err_code = ble_pbs_drhc_update(&m_pbs, drhc_sim_data);
//    if ((err_code != NRF_SUCCESS) &&
//        (err_code != NRF_ERROR_INVALID_STATE) &&
//        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
//        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
//        )
//    {
//        APP_ERROR_HANDLER(err_code);
//    }
//}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */

static void dhrc_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
		
		// Start flash write simulation
	if (pktCounter == 0 && esc_notify_flag)
	{
		float cal_acc_test[3];	
		cal_acc_test[0] = 12;
		cal_acc_test[1] = 25;
		cal_acc_test[2] = 30;			
		int w_cnt = 600 * 3;
		flash_data_set_init();	
		while(w_cnt--) {
				if (w_cnt == 1000) {
					flash_data_set_write(NULL, cal_acc_test, 1, w_cnt);
				} else if (w_cnt == 500) {
					flash_data_set_write(NULL, cal_acc_test, 2, w_cnt);
				}	else {
					flash_data_set_write(NULL, cal_acc_test,0, 0);
				}	
		}
		nrf_delay_ms(20);
		pktCounter = 125;
		m_pbs.esc_s.number_of_event = 1;
		uint8_t esc_sim_data[3] = {0,0,1};
		ble_pbs_esc_update(&m_pbs, esc_sim_data);
		printf("flash write simulation\r\n");
	}
	
	
	// Simulator flash read
		uint32_t r_xy;
		uint32_t r_z;
		uint8_t r_event_ID;
		uint32_t r_UTC;
		int ret;
		uint16_t data_x[4] = {0};
		uint16_t data_y[4] = {0};
		uint16_t data_z[4] = {0};
		uint8_t len = 0;
		uint8_t p_cal_encoded_buffer[20] = {0};
		p_cal_encoded_buffer[0] = pktCounter;
		p_cal_encoded_buffer[1] = 18;
		uint32_t err_code;
		uint8_t pktNum=0;
		if (pktCounter > 0 && cdrc_notify_flag== true && start_dw_flag)
		{
			printf("pktCounter : %i ",pktCounter);
			pktCounter--;

			// Simulator flash read, assign to uint16_t array
			for(int i=0;i<4;i++)
			{
				ret=flash_data_set_read(NULL, NULL, &r_xy, &r_z, &r_event_ID, &r_UTC);
				data_x[i] = (uint16_t)((r_xy&0xFFFF0000)>>16);
				data_y[i] = (uint16_t)(r_xy&0xFFFF);
				data_z[i] = (uint16_t)(r_z&0xFFFF);
				
//				if (ret < 0)	
//					printf("ret error:0\r\n");
//				else
//					printf("ret: %i read x: %f read y: %f read z: %f\n\r", ret,(float)((r_xy&0xFFFF0000)>>16)/100-16,(float)(r_xy&0x0000FFFF)/100-16, (float)r_z/100-16);
				
//				printf("ret: %i data_X:%04X ",ret,data_x[i]);
//				printf("data_y:%04X ",data_y[i]);
//					printf("data_z:%04X\r\n",data_z[i]);
				//nrf_delay_ms(10);
			}
			pktNum=0;
			// assign 4 read data value to cdrc data packet
			for (int i=2;i<20;i=i+9)
			{
				p_cal_encoded_buffer[i] = (uint8_t) (data_z[pktNum]& 0xFF) ;
				p_cal_encoded_buffer[i+1] = ((data_z[pktNum]& 0x0F00) >> 8) | ((data_y[pktNum]&0x0F) << 4);
				p_cal_encoded_buffer[i+2] = (uint8_t) ((data_y[pktNum]& 0x0FF0) >> 4) ;
				p_cal_encoded_buffer[i+3] = (uint8_t) (data_x[pktNum]& 0xFF)  ;
				p_cal_encoded_buffer[i+4] = ((data_x[pktNum]& 0x0F00) >> 8) | ((data_z[pktNum+1]&0x0F) << 4);
				p_cal_encoded_buffer[i+5] = (uint8_t) ((data_z[pktNum+1]& 0x0FF0) >> 4) ;
				p_cal_encoded_buffer[i+6] = (uint8_t) (data_y[pktNum+1]& 0xFF) ;
				p_cal_encoded_buffer[i+7] = ((data_y[pktNum+1]& 0x0F00) >> 8) | ((data_x[pktNum+1]&0x0F) << 4);
				p_cal_encoded_buffer[i+8] = (uint8_t) ((data_x[pktNum+1]& 0x0FF0) >> 4) ;
				pktNum += 2;
			}
			printf("ret: %i,Cal data:",ret);
			for(int i=19;i>=0;i--)
			{
				printf("%02X ",p_cal_encoded_buffer[i]);
			}
			printf("\r\n");
			err_code = ble_pbs_cdrc_update(&m_pbs, p_cal_encoded_buffer);
		}
			
		
//	// Check Download control point
//		uint32_t err_code = NRF_SUCCESS;
//    ble_gatts_value_t gatts_value;
//		memset(&gatts_value, 0, sizeof(gatts_value));
//		gatts_value.len     = 1;
//		gatts_value.offset  = 0;
//		//gatts_value.p_value = &dhrc_data;
//		err_code = sd_ble_gatts_value_get(m_pbs.conn_handle,
//																			m_pbs.esc_handles.value_handle,
//																			&gatts_value);
//	printf("get value err:%04X, value:%02X\r\n",err_code,gatts_value.p_value[0]);
//	
//	if (m_pbs.esc_s.download_control_point == 0x01)
//    ble_drhc_update();
//	else 
//	{
//		printf("download_control_point:%d\r\n",m_pbs.esc_s.download_control_point);
//	}
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

